sdc_load_test.yml
config:
  target: 'http://localhost:3002'
  http:
    pool: 10
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
    - duration: 30
      arrivalRate: 100
      rampTo: 250
    - duration: 30
      arrivalRate: 250
      rampTo: 500
    - duration: 60
      arrivalRate: 500
      rampTo: 1200
    - duration: 300
      arrivalRate: 1200
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  payload:
    path: "./loadTestIds.csv"
    fields:
      - "place_id"
scenarios:
  - flow:
    - get:
        url: "/api/restaurants/{{place_id}}/gallery"